#################################
## <Á¦2Àå ¿¬½À¹®Á¦>
#################################

# 01. ´ÙÀ½°ú °°Àº º¤ÅÍ °´Ã¼¸¦ »ı¼ºÇÏ½Ã¿À.

#1) Vec1 º¤ÅÍ º¯¼ö¸¦ ¸¸µé°í, 1~5±îÁö ¿¬¼ÓµÈ Á¤¼ö¸¦ ¸¸µå½Ã¿À. - c()ÇÔ¼ö ÀÌ¿ë
Vec1<-c(1:5)
Vec1
#2) Vec2 º¤ÅÍ º¯¼ö¿¡ 1~10±îÁö 3°£°İÀ¸·Î ¿¬¼ÓµÈ Á¤¼ö¸¦ ¸¸µå½Ã¿À. - seq()ÇÔ¼ö ÀÌ¿ë 
Vec2<-seq(from=1,to=10,by=3)

#3) Vec3 º¤ÅÍ º¯¼ö¿¡ "R" ¹®ÀÚ°¡ 5È¸ ¹İº¹µÇµµ·Ï ÇÏ½Ã¿À. - rep()ÇÔ¼ö ÀÌ¿ë 
Vec3<-rep("R",5)
help(rep)
Vec3

#4) Vec4¿¡´Â Vec1~Vec2°¡ ¸ğµÎ Æ÷ÇÔµÇ´Â º¤ÅÍ¸¦ ¸¸µå½Ã¿À. - c()ÇÔ¼ö ÀÌ¿ë 
Vec4<-c(Vec1,Vec2)

#5) 25~ -15±îÁö 5°£°İÀ¸·Î º¤ÅÍ »ı¼º - seq()ÇÔ¼ö ÀÌ¿ë 
seq(from=25,to=15,by=-5)


#6) Vec4¿¡¼­ È¦¼ö¹øÂ° °ªµé¸¸ ¼±ÅÃÇÏ¿© Vec5¿¡ ÇÒ´çÇÏ½Ã¿À. - »öÀÎ ÀÌ¿ë
Vec5 <- Vec4[seq(1,length(Vec4), 2)]
Vec5 # 1  3  5  4 10

# 02. ´ÙÀ½ µÎ °³ÀÇ º¤ÅÍ¸¦ ÀÌ¿ëÇÏ¿© ´Ü°èº°·Î Ã³¸®ÇÏ½Ã¿À. 
v1 <- c(2,3,10,-5,8)
v2 <- c(40,50,-30,7,10)

# ´Ü°è1> Çà ´ÜÀ§·Î ¹­¾î¼­ matrix »ı¼ºÇÏ±â  
mat<-rbind(v1,v2)
mat
# ´Ü°è2> matrix Â÷¿ø º¸±â 
dim(mat) # 2,5

# ´Ü°è3> matrix ¿­ ´ÜÀ§ ÇÕ°è °è»êÇÏ±â 
sum<-apply(mat,2,sum)
sum

# 03. ´ÙÀ½°ú °°Àº º¤ÅÍ¸¦ Ä®·³À¸·Î °®´Â DataFrameÀ» »ı¼ºÇÏ½Ã¿À.

name <-c("ÃÖ¹Î¼ö","À¯°ü¼ø", "ÀÌ¼ø½Å","±èÀ¯½Å","È«±æµ¿")
age <-c(55,45,45,53,15) #¿¬·É
gender <-c(1,2,1,1,1) #1:³²ÀÚ, 2: ¿©ÀÚ
job <-c("¿¬¿¹ÀÎ","ÁÖºÎ","±ºÀÎ","Á÷ÀåÀÎ","ÇĞ»ı")
sat <-c(3,4,2,5,5) # ¸¸Á·µµ
grade <- c("C","C","A","D","A")
total <-c(44.4,28.5,43.5,NA,27.1) #ÃÑ±¸¸Å±İ¾×(NA:°áÃøÄ¡)

# <Á¶°Ç1> À§ 7°³ º¤ÅÍ¸¦ userÀÌ¸§À¸·Î µ¥ÀÌÅÍ ÇÁ·¹ÀÓ »ı¼º
user<-data.frame(name,age,gender,job,sat,grade,total)

# <Á¶°Ç2> ÃÑ±¸¸Å±İ¾×(total) º¯¼ö¸¦ ÀÌ¿ëÇÏ¿© È÷½ºÅä±×·¥ ±×¸®±â-hist()
hist(user$total)

# <Á¶°Ç3> ¸¸Á·µµ(sat) º¯¼ö¸¦ ÀÌ¿ëÇÏ¿© »êÁ¡µµ ±×¸®±â-plot()
plot(user$sat)



# 04. Data¸¦ ´ë»óÀ¸·Î apply()¸¦ Àû¿ëÇÏ¿© Çà/¿­ ¹æÇâÀ¸·Î Á¶°Ç¿¡ ¸Â°Ô Åë°è·®À» ±¸ÇÏ½Ã¿À.

kor <- c(90,85,90)
eng <- c(70,85,75)
mat <- c(86,92,88)    

# Á¶°Ç1) 3°³ÀÇ °ú¸ñÁ¡¼ö¸¦ ÀÌ¿ëÇÏ¿© µ¥ÀÌÅÍÇÁ·¹ÀÓ(Data)À» »ı¼ºÇÑ´Ù. 
Data<-data.frame(kor,eng,mat)
Data
# Á¶°Ç2) Çà/¿­ ¹æÇâÀ¸·Î max()ÇÔ¼ö¸¦ Àû¿ëÇÏ¿© ÃÖ´ñ°ª ±¸ÇÏ±â
apply(Data,1,max)
apply(Data,2,max)
# Á¶°Ç3) Çà/¿­ ¹æÇâÀ¸·Î mean()ÇÔ¼ö¸¦ Àû¿ëÇÏ¿© Æò±Õ ±¸ÇÏ±â(¼Ò¼ıÁ¡ 2ÀÚ¸® ±îÁö Ç¥Çö)
#  ÈùÆ® : round(data, ÀÚ¸´¼ö)
round(apply(Data,1,mean),2)
round(apply(Data,2,mean),2)

# Á¶°Ç4) Çà ´ÜÀ§ ºĞ»ê°ú Ç¥ÁØÆíÂ÷ ±¸ÇÏ±â  
#  ÈùÆ® : var(), sd()
apply(Data,1,var)
apply(Data,2,var)

# 05. ´ÙÀ½ÀÇ Data2 °´Ã¼¸¦ ´ë»óÀ¸·Î Á¤±ÔÇ¥Çö½ÄÀ» Àû¿ëÇÏ¿© ¹®ÀÚ¿­À» Ã³¸®ÇÏ½Ã¿À
Data2 <- c("2017-02-05 ¼öÀÔ3000¿ø","2017-02-06 ¼öÀÔ4500¿ø","2017-02-07 ¼öÀÔ2500¿ø")
library(stringr)


# Á¶°Ç1) ÀÏÂ¥º° ¼öÀÔÀ» ´ÙÀ½°ú °°ÀÌ Ãâ·ÂÇÏ½Ã¿À. 
#        Ãâ·Â °á°ú) "3000¿ø" "4500¿ø" "2500¿ø" 
str_extract(Data2,'[0-9]{4}[°¡-ÆR]')
help(str_extract)


# Á¶°Ç2) À§ º¤ÅÍ¿¡¼­ ¿¬¼ÓÇÏ¿© 2°³ ÀÌ»ó ³ª¿À´Â ¸ğµç ¼ıÀÚ¸¦ Á¦°ÅÇÏ½Ã¿À.  
#        Ãâ·Â °á°ú) "-- ¼öÀÔ¿ø" "-- ¼öÀÔ¿ø" "-- ¼öÀÔ¿ø"  
str_replace_all(Data2,'[0-9]{2}','')

# Á¶°Ç3) À§ º¤ÅÍ¿¡¼­ -¸¦ /·Î Ä¡È¯ÇÏ½Ã¿À.
#        Ãâ·Â °á°ú) "2017/02/05 ¼öÀÔ3000¿ø" "2017/02/06 ¼öÀÔ4500¿ø" "2017/02/07 ¼öÀÔ2500¿ø"  
#¼Ò¸¦ ½°Ç¥(,)¿¡ ÀÇÇØ¼­ ÇÏ³ªÀÇ ¹®ÀÚ¿­·Î ÇÕÄ¡½Ã¿À. 
# ÈùÆ®) paste(µ¥ÀÌÅÍ¼Â, collapse="±¸ºĞÀÚ")ÇÔ¼ö ÀÌ¿ë
#        Ãâ·Â °á°ú) "2017-02-05 ¼öÀÔ3000¿ø,2017-02-06 ¼öÀÔ4500¿ø,2017-02-07 ¼öÀÔ2500¿ø"

str_replace_all(Data2,'-','/')


str_c(Data2,collapse = ',')
